; domain
(define (domain logistics)
  (:requirements :strips :typing) 
  (:types carrier
          agent - vehicle
          crate
          vehicle - physobj
          airport
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?p - place ?city - city) ; person in the city
		(at ?obj - physobj ?loc - place)
		(in ?pkg - crate ?veh - vehicle))
  
(:action LOAD-CARRIER
   :parameters    (?pkg - crate ?carrier - carrier ?loc - place)
   :precondition  (and (at ?carrier ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?carrier)))

(:action LOAD-AGENT
  :parameters   (?pkg - crate ?agent - agent ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?agent ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?agent)))

(:action UNLOAD-CARRIER
  :parameters   (?pkg - crate ?carrier - carrier ?loc - place)
  :precondition (and (at ?carrier ?loc) (in ?pkg ?carrier))
  :effect       (and (not (in ?pkg ?carrier)) (at ?pkg ?loc)))

(:action UNLOAD-AGENT
  :parameters    (?pkg - crate ?agent - agent ?loc - place)
  :precondition  (and (in ?pkg ?agent) (at ?agent ?loc))
  :effect        (and (not (in ?pkg ?agent)) (at ?pkg ?loc)))

(:action MOVE-CARRIER
  :parameters (?carrier - carrier ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?carrier ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?carrier ?loc-from)) (at ?carrier ?loc-to)))

(:action FLY-AGENT
  :parameters (?agent - agent ?loc-from - airport ?loc-to - airport)
  :precondition
   (at ?agent ?loc-from)
  :effect
   (and (not (at ?agent ?loc-from)) (at ?agent ?loc-to)))
)

; problem
(define (problem logistics-5-1)
(:domain logistics)
(:objects
  apn1 - agent
  apt2 apt1 - airport
   depot pos2 pos1 - location
   cit2 cit1 - city
   tru2 tru1 - carrier
   food_1 food_2 food_3 food_4 food_5 food_6 food_7 food_8 - crate)

(:init 
        (at apn1 apt1) (at tru1 pos1) ;(at obj11 pos1)
        (at food_1 depot) (at food_2 depot) (at food_3 depot) (at food_4 depot) 
        (at food_5 depot) (at food_6 depot) (at food_7 depot) (at food_8 depot)
        ;(at obj12 pos1) (at obj13 pos1) 
        (at tru2 pos2) 
        ;(at obj21 pos2) (at obj22 pos2)(at obj23 pos2) 
        (in-city depot cit1)(in-city pos1 cit1) (in-city apt1 cit1) (in-city pos2 cit2)
        (in-city apt2 cit2))

(:goal (and 
            (at food_1 pos1) (at food_2 pos1) (at food_3 pos2) (at food_4 pos1) (at food_5 pos2) 
            (at food_6 pos1) (at food_7 pos2) (at food_8 pos2)
        )
    )
)

; plan
1. (move-carrier tru1 pos1 depot cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 depot)
   goals met: 0 of 8
2. (load-carrier food_1 tru1 depot)
   deleted: (at food_1 depot)
   added: (in food_1 tru1)
   goals met: 0 of 8
3. (move-carrier tru1 depot apt1 cit1)
   deleted: (at tru1 depot)
   added: (at tru1 apt1)
   goals met: 0 of 8
4. (move-carrier tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 0 of 8
5. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 0 of 8
6. (move-carrier tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 0 of 8
7. (unload-carrier food_1 tru1 pos1)
   deleted: (in food_1 tru1)
   added: (at food_1 pos1)
   goals met: 1 of 8
8. (move-carrier tru1 pos1 depot cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 depot)
   goals met: 1 of 8
9. (load-carrier food_2 tru1 depot)
   deleted: (at food_2 depot)
   added: (in food_2 tru1)
   goals met: 1 of 8
10. (move-carrier tru1 depot apt1 cit1)
   deleted: (at tru1 depot)
   added: (at tru1 apt1)
   goals met: 1 of 8
11. (fly-agent apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 1 of 8
12. (move-carrier tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 1 of 8
13. (move-carrier tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 1 of 8
14. (unload-carrier food_2 tru1 pos1)
   deleted: (in food_2 tru1)
   added: (at food_2 pos1)
   goals met: 2 of 8
15. (move-carrier tru1 pos1 depot cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 depot)
   goals met: 2 of 8
16. (load-carrier food_3 tru1 depot)
   deleted: (at food_3 depot)
   added: (in food_3 tru1)
   goals met: 2 of 8
17. (load-carrier food_4 tru1 depot)
   deleted: (at food_4 depot)
   added: (in food_4 tru1)
   goals met: 2 of 8
18. (move-carrier tru1 depot apt1 cit1)
   deleted: (at tru1 depot)
   added: (at tru1 apt1)
   goals met: 2 of 8
19. (unload-carrier food_3 tru1 apt1)
   deleted: (in food_3 tru1)
   added: (at food_3 apt1)
   goals met: 2 of 8
20. (move-carrier tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 2 of 8
21. (load-agent food_3 apn1 apt1)
   deleted: (at food_3 apt1)
   added: (in food_3 apn1)
   goals met: 2 of 8
22. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 2 of 8
23. (unload-agent food_3 apn1 apt2)
   deleted: (in food_3 apn1)
   added: (at food_3 apt2)
   goals met: 2 of 8
24. (load-carrier food_3 tru2 apt2)
   deleted: (at food_3 apt2)
   added: (in food_3 tru2)
   goals met: 2 of 8
25. (move-carrier tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 2 of 8
26. (unload-carrier food_4 tru1 pos1)
   deleted: (in food_4 tru1)
   added: (at food_4 pos1)
   goals met: 3 of 8
27. (move-carrier tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 3 of 8
28. (unload-carrier food_3 tru2 pos2)
   deleted: (in food_3 tru2)
   added: (at food_3 pos2)
   goals met: 4 of 8
29. (move-carrier tru1 pos1 depot cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 depot)
   goals met: 4 of 8
30. (load-carrier food_5 tru1 depot)
   deleted: (at food_5 depot)
   added: (in food_5 tru1)
   goals met: 4 of 8
31. (load-carrier food_6 tru1 depot)
   deleted: (at food_6 depot)
   added: (in food_6 tru1)
   goals met: 4 of 8
32. (move-carrier tru1 depot apt1 cit1)
   deleted: (at tru1 depot)
   added: (at tru1 apt1)
   goals met: 4 of 8
33. (unload-carrier food_5 tru1 apt1)
   deleted: (in food_5 tru1)
   added: (at food_5 apt1)
   goals met: 4 of 8
34. (move-carrier tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 4 of 8
35. (fly-agent apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 4 of 8
36. (load-agent food_5 apn1 apt1)
   deleted: (at food_5 apt1)
   added: (in food_5 apn1)
   goals met: 4 of 8
37. (move-carrier tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 4 of 8
38. (unload-carrier food_6 tru1 pos1)
   deleted: (in food_6 tru1)
   added: (at food_6 pos1)
   goals met: 5 of 8
39. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 5 of 8
40. (unload-agent food_5 apn1 apt2)
   deleted: (in food_5 apn1)
   added: (at food_5 apt2)
   goals met: 5 of 8
41. (load-carrier food_5 tru2 apt2)
   deleted: (at food_5 apt2)
   added: (in food_5 tru2)
   goals met: 5 of 8
42. (move-carrier tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 5 of 8
43. (unload-carrier food_5 tru2 pos2)
   deleted: (in food_5 tru2)
   added: (at food_5 pos2)
   goals met: 6 of 8
44. (move-carrier tru1 pos1 depot cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 depot)
   goals met: 6 of 8
45. (load-carrier food_7 tru1 depot)
   deleted: (at food_7 depot)
   added: (in food_7 tru1)
   goals met: 6 of 8
46. (load-carrier food_8 tru1 depot)
   deleted: (at food_8 depot)
   added: (in food_8 tru1)
   goals met: 6 of 8
47. (move-carrier tru1 depot apt1 cit1)
   deleted: (at tru1 depot)
   added: (at tru1 apt1)
   goals met: 6 of 8
48. (unload-carrier food_8 tru1 apt1)
   deleted: (in food_8 tru1)
   added: (at food_8 apt1)
   goals met: 6 of 8
49. (unload-carrier food_7 tru1 apt1)
   deleted: (in food_7 tru1)
   added: (at food_7 apt1)
   goals met: 6 of 8
50. (move-carrier tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 6 of 8
51. (fly-agent apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 6 of 8
52. (load-agent food_8 apn1 apt1)
   deleted: (at food_8 apt1)
   added: (in food_8 apn1)
   goals met: 6 of 8
53. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 6 of 8
54. (unload-agent food_8 apn1 apt2)
   deleted: (in food_8 apn1)
   added: (at food_8 apt2)
   goals met: 6 of 8
55. (load-carrier food_8 tru2 apt2)
   deleted: (at food_8 apt2)
   added: (in food_8 tru2)
   goals met: 6 of 8
56. (move-carrier tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 6 of 8
57. (unload-carrier food_8 tru2 pos2)
   deleted: (in food_8 tru2)
   added: (at food_8 pos2)
   goals met: 7 of 8
58. (move-carrier tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 7 of 8
59. (fly-agent apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 7 of 8
60. (load-agent food_7 apn1 apt1)
   deleted: (at food_7 apt1)
   added: (in food_7 apn1)
   goals met: 7 of 8
61. (fly-agent apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 7 of 8
62. (unload-agent food_7 apn1 apt2)
   deleted: (in food_7 apn1)
   added: (at food_7 apt2)
   goals met: 7 of 8
63. (load-carrier food_7 tru2 apt2)
   deleted: (at food_7 apt2)
   added: (in food_7 tru2)
   goals met: 7 of 8
64. (move-carrier tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 7 of 8
65. (unload-carrier food_7 tru2 pos2)
   deleted: (in food_7 tru2)
   added: (at food_7 pos2)
   goals met: 8 of 8
